## Staging: newrelic
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
```terraform
Plan: 1 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                         NAME                                         |
|--------|--------------------------------------------------------------------------------------|
| add    | `newrelic_nrql_alert_condition.tf_lambda_api_errors_count_anomaly_unexpected_errors` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # newrelic_nrql_alert_condition.tf_lambda_api_errors_count_anomaly_unexpected_errors will be created
  + resource "newrelic_nrql_alert_condition" "tf_lambda_api_errors_count_anomaly_unexpected_errors" {
      + account_id                   = 2691974
      + aggregation_delay            = "300"
      + aggregation_method           = "event_flow"
      + aggregation_window           = 60
      + baseline_direction           = "upper_and_lower"
      + enabled                      = true
      + entity_guid                  = (known after apply)
      + id                           = (known after apply)
      + name                         = "Staging - Terraform - [Lambda API] Errors count anomaly (Unexpected Errors)"
      + policy_id                    = 2801728
      + type                         = "baseline"
      + violation_time_limit         = (known after apply)
      + violation_time_limit_seconds = 86400

      + critical {
          + operator              = "above"
          + threshold             = 6
          + threshold_duration    = 300
          + threshold_occurrences = "all"
        }

      + nrql {
          + query = "SELECT count(*) FROM AwsLambdaInvocationError WHERE (`entityGuid`='MjY5MTk3NHxJTkZSQXxOQXwtNzgwNDUyNTc5NzAyODI1NTcyNw') and error.class NOT IN ('app.v2.errors:BadRequestError','jsonschema.exceptions:ValidationError', 'sqlalchemy.exc:NoResultFound', 'app.authentication.auth:AuthError', 'werkzeug.exceptions:MethodNotAllowed') and error.message NOT LIKE '{\\'result\\': \\'error\\', \\'message\\': {\\'password\\': [\\'Incorrect password\\']}}'"
        }

      + warning {
          + operator              = "above"
          + threshold             = 3
          + threshold_duration    = 300
          + threshold_occurrences = "all"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

